![png](Data/Movies-ERD.png)

In [1]:
from sqlalchemy.engine import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
import pandas as pd

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root"
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [5]:
q = '''DESCRIBE genres;'''
describe = pd.read_sql(q, conn)
describe

  Field         Type Null  Key Default Extra
0    id          int   NO  PRI    None
1  name  varchar(45)  YES         None

In [6]:
q = '''DESCRIBE ratings;'''
describe = pd.read_sql(q, conn)
describe

                 Field Type Null  Key Default Extra
0               tconst  int   NO  PRI    None
1       average_rating  int  YES         None
2      number_of_votes  int  YES         None
3  title_basics_tconst  int   NO  PRI    None

In [7]:
q = '''DESCRIBE title_basics;'''
describe = pd.read_sql(q, conn)
describe

           Field         Type Null  Key Default Extra
0         tconst          int   NO  PRI    None
1  primary_title  varchar(45)  YES         None
2     start_year          int  YES         None
3        runtime          int  YES         None

In [8]:
q = '''DESCRIBE title_genres;'''
describe = pd.read_sql(q, conn)
describe

       Field Type Null Key Default Extra
0     tconst  int   NO        None
1  genres_id  int   NO        None